app/views/tweets/detail.html.erb

SELECT COUNT(*) FROM `likes` WHERE `likes`.`tweet_id` = 19
---

  <h3>いいね♡: <%= @tweet.likes.count %></h3>

SELECT `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1
---

      <span class ="space"><%= c.user.name unless c.user.blank? %></span>