app/controllers/comments_controller.rb

SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 14 LIMIT 1
INSERT INTO `comments` (`comment`, `user_id`, `tweet_id`, `created_at`, `updated_at`) VALUES ('あああ', 6, 19, '2020-05-18 13:28:22.199762', '2020-05-18 13:28:22.199762')
---
    def create
      tweet = Tweet.find(params[:tweet_id])
      @comment = tweet.comments.build(comment_params)
      @comment.user_id = current_user.id

      if @comment.save