app/controllers/likes_controller.rb

    def create
        @like = current_user.likes.create(tweet_id: params[:tweet_id])
---
INSERT INTO `likes` (`tweet_id`, `user_id`, `created_at`, `updated_at`) VALUES (13, 4, '2020-05-18 09:00:48.954108', '2020-05-18 09:00:48.954108')

    def destroy
        @like = Like.find_by(tweet_id: params[:tweet_id], user_id: current_user.id)
        @like.destroy
---
SELECT `likes`.* FROM `likes` WHERE `likes`.`tweet_id` = 13 AND `likes`.`user_id` = 4 LIMIT 1
DELETE FROM `likes` WHERE `likes`.`id` = 1