app/controllers/tweets_controller.rb

    def index #一覧ページ

        if params[:search] == nil
            @tweets= Tweet.all.page(params[:page]).per(3)
---
SELECT COUNT(*) FROM (SELECT 1 AS one FROM `tweets` WHERE ((body LIKE '%あや%' ) OR (tweet.user.name LIKE '%あや%' )) LIMIT 3 OFFSET 0) subquery_for_count
SELECT `tweets`.* FROM `tweets` WHERE (body LIKE '%あや%' ) LIMIT 3 OFFSET 0

    def create
        @tweet = Tweet.new(tweet_params)
        @tweet.user_id = current_user.id

        if @tweet.save
---
INSERT INTO `tweets` (`created_at`, `updated_at`, `body`, `image`, `user_id`) VALUES ('2020-05-20 06:25:28.172709', '2020-05-20 06:25:28.172709', 'ともだちのナーユン', 'AN.jpg', 9)

    def detail #ツイート詳細ページ
        @tweet = Tweet.find(params[:id])
---
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 26 LIMIT 1

    def edit #ツイート内容編集ページ
        @tweet = Tweet.find(params[:id])
---
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 12 LIMIT 1

    def update
        @tweet = Tweet.find(params[:id])

        if @tweet.update(tweet_params)
---
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 26 LIMIT 1
UPDATE `tweets` SET `tweets`.`body` = 'くるまに乗りたいよね', `tweets`.`updated_at` = '2020-05-20 06:14:31.142023' WHERE `tweets`.`id` = 13

    def destroy
        Tweet.find(params[:id]).destroy
---
DELETE FROM `tweets` WHERE `tweets`.`id` = 21
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 21 LIMIT 1