app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
---
    def edit #ユーザー詳細編集ページ
        @user = User.find(params[:id])

UPDATE `users` SET `users`.`profile` = 'サッカーとねこが好き', `users`.`updated_at` = '2020-05-20 06:24:22.701511' WHERE `users`.`id` = 9
---
    def update
        # アップデートがうまくいけば、マイページに戻利、
        # うまくいかなければ、もう一度編集ページを表示する
        if current_user.update(user_params)